Sasha7b9Work/PKS/sources/common/GD32F30x_Library/Firmware/GD32F30x_standard_peripheral/Source/_gd32f30x_rcu_.c
/*!
    \file    gd32f30x_rcu.c
    \brief   RCU driver

    \version 2017-02-10, V1.0.0, firmware for GD32F30x
    \version 2018-10-10, V1.1.0, firmware for GD32F30x
    \version 2018-12-25, V2.0.0, firmware for GD32F30x
    \version 2020-09-30, V2.1.0, firmware for GD32F30x
*/

/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f30x_rcu.h"

/* define clock source */
#define SEL_IRC8M                   ((uint16_t)0U)  /* IRC8M is selected as CK_SYS */
#define SEL_HXTAL                   ((uint16_t)1U)  /* HXTAL is selected as CK_SYS */
#define SEL_PLL                     ((uint16_t)2U)  /* PLL is selected as CK_SYS */

/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT         ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT       ((uint32_t)0x03FFFFFFU)

/* ADC clock prescaler offset */
#define RCU_ADC_PSC_OFFSET          ((uint32_t)14U)

/* RCU IRC8M adjust value mask and offset*/
#define RCU_IRC8M_ADJUST_MASK       ((uint8_t)0x1FU)
#define RCU_IRC8M_ADJUST_OFFSET     ((uint32_t)3U)

/* RCU PLL1 clock multiplication factor offset */
#define RCU_CFG1_PLL1MF_OFFSET      ((uint32_t)8U)
/* RCU PREDV1 division factor offset*/
#define RCU_CFG1_PREDV1_OFFSET      ((uint32_t)4U)


/*!
    \brief      deinitialize the RCU
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_deinit(void)
{
    /* enable IRC8M */
    RCU_CTL |= RCU_CTL_IRC8MEN;
    rcu_osci_stab_wait(RCU_IRC8M);
      
    RCU_CFG0 &= ~RCU_CFG0_SCS;
      
    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_PLLEN);
    RCU_CTL &= ~RCU_CTL_HXTALBPS;

    /* reset CFG0 register */
#if (defined(GD32F30X_HD) || defined(GD32F30X_XD))
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC | RCU_CFG0_APB1PSC | RCU_CFG0_APB2PSC |
                  RCU_CFG0_ADCPSC | RCU_CFG0_PLLSEL | RCU_CFG0_PREDV0 | RCU_CFG0_PLLMF |
                  RCU_CFG0_USBDPSC | RCU_CFG0_CKOUT0SEL | RCU_CFG0_PLLMF_4 | RCU_CFG0_ADCPSC_2 | RCU_CFG0_PLLMF_5 | RCU_CFG0_USBDPSC_2);
#elif defined(GD32F30X_CL)
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC | RCU_CFG0_APB1PSC | RCU_CFG0_APB2PSC |
                  RCU_CFG0_ADCPSC | RCU_CFG0_PLLSEL | RCU_CFG0_PREDV0_LSB | RCU_CFG0_PLLMF |
                  RCU_CFG0_USBFSPSC | RCU_CFG0_CKOUT0SEL | RCU_CFG0_ADCPSC_2 | RCU_CFG0_PLLMF_4 | RCU_CFG0_PLLMF_5 | RCU_CFG0_USBFSPSC_2);
#endif /* GD32F30X_HD and GD32F30X_XD */
    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_PLLEN);
    RCU_CTL &= ~RCU_CTL_HXTALBPS;
#ifdef GD32F30X_CL
    RCU_CTL &= ~(RCU_CTL_PLL1EN | RCU_CTL_PLL2EN);
#endif /* GD32F30X_CL */

    /* reset INT and CFG1 register */
#if (defined(GD32F30X_HD) || defined(GD32F30X_XD))
    RCU_INT = 0x009f0000U;
    RCU_CFG1 &= ~(RCU_CFG1_ADCPSC_3 | RCU_CFG1_PLLPRESEL);
#elif defined(GD32F30X_CL)
    RCU_INT = 0x00ff0000U;
    RCU_CFG1 &= ~(RCU_CFG1_PREDV0 | RCU_CFG1_PREDV1 | RCU_CFG1_PLL1MF | RCU_CFG1_PLL2MF |
                  RCU_CFG1_PREDV0SEL | RCU_CFG1_I2S1SEL | RCU_CFG1_I2S2SEL | RCU_CFG1_ADCPSC_3 |
                  RCU_CFG1_PLLPRESEL | RCU_CFG1_PLL2MF_4);
#endif /* GD32F30X_HD and GD32F30X_XD */
}

///*!
//    \brief      enable the peripherals clock
//    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
//                only one parameter can be selected which is shown as below:
//      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G): GPIO ports clock
//      \arg        RCU_AF : alternate function clock
//      \arg        RCU_CRC: CRC clock
//      \arg        RCU_DMAx (x = 0,1): DMA clock
//      \arg        RCU_ENET: ENET clock(CL series available)
//      \arg        RCU_ENETTX: ENETTX clock(CL series available)
//      \arg        RCU_ENETRX: ENETRX clock(CL series available)
//      \arg        RCU_USBD: USBD clock(HD,XD series available)
//      \arg        RCU_USBFS: USBFS clock(CL series available)
//      \arg        RCU_EXMC: EXMC clock
//      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,8,9,10,11,12,13,TIMER8..13 are not available for HD series): TIMER clock
//      \arg        RCU_WWDGT: WWDGT clock
//      \arg        RCU_SPIx (x = 0,1,2): SPI clock
//      \arg        RCU_USARTx (x = 0,1,2): USART clock
//      \arg        RCU_UARTx (x = 3,4): UART clock
//      \arg        RCU_I2Cx (x = 0,1): I2C clock
//      \arg        RCU_CANx (x = 0,1,CAN1 is only available for CL series): CAN clock
//      \arg        RCU_PMU: PMU clock
//      \arg        RCU_DAC: DAC clock
//      \arg        RCU_RTC: RTC clock
//      \arg        RCU_ADCx (x = 0,1,2,ADC2 is not available for CL series): ADC clock
//      \arg        RCU_SDIO: SDIO clock(not available for CL series)
//      \arg        RCU_CTC: CTC clock
//      \arg        RCU_BKPI: BKP interface clock
//    \param[out] none
//    \retval     none
//*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

///*!
//    \brief      disable the peripherals clock
//    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
//                only one parameter can be selected which is shown as below:
//      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G): GPIO ports clock
//      \arg        RCU_AF: alternate function clock
//      \arg        RCU_CRC: CRC clock
//      \arg        RCU_DMAx (x = 0,1): DMA clock
//      \arg        RCU_ENET: ENET clock(CL series available)
//      \arg        RCU_ENETTX: ENETTX clock(CL series available)
//      \arg        RCU_ENETRX: ENETRX clock(CL series available)
//      \arg        RCU_USBD: USBD clock(HD,XD series available)
//      \arg        RCU_USBFS: USBFS clock(CL series available)
//      \arg        RCU_EXMC: EXMC clock
//      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,8,9,10,11,12,13,TIMER8..13 are not available for HD series): TIMER clock
//      \arg        RCU_WWDGT: WWDGT clock
//      \arg        RCU_SPIx (x = 0,1,2): SPI clock
//      \arg        RCU_USARTx (x = 0,1,2): USART clock
//      \arg        RCU_UARTx (x = 3,4): UART clock
//      \arg        RCU_I2Cx (x = 0,1): I2C clock
//      \arg        RCU_CANx (x = 0,1,CAN1 is only available for CL series): CAN clock
//      \arg        RCU_PMU: PMU clock
//      \arg        RCU_DAC: DAC clock
//      \arg        RCU_RTC: RTC clock
//      \arg        RCU_ADCx (x = 0,1,2,ADC2 is not available for CL series): ADC clock
//      \arg        RCU_SDIO: SDIO clock(not available for CL series)
//      \arg        RCU_CTC: CTC clock
//      \arg        RCU_BKPI: BKP interface clock
//    \param[out] none
//    \retval     none
//*/

